<template>
  <div class="hello">
    <h1>{{ msg }}</h1>
    <h2>组建中的(新项目), 活跃的(更新维护), 冷却的, 失效的(+失败的) | 供应商 | 拍卖行</h2>
    <ul v-if="list.length" class="plist">
      <li v-for="item in list"><router-link :to="{ name: 'p', params: { id: item.id }}">{{ item.name }}</router-link></li>
    </ul>
    <p>
      项目列中的某个项目/ 此项目下有多个项目组, 每个项目组维护一个项目分支(差异与不同?), 项目分支并非级联主项目, 而是可关联多个项目及需求想法灵感<br>
      // 项目发起人, 与项目组关系(小组对话一般是不必要全组通知的, 故不太必要保留大组频道?) 项目下有多个小组分支, 或许可以直接排除项目整组..?(公开领域注意)<br>
      // 项目列下分支项目状态, 分支后的项目即是主项目, 由唯一?项目组维护, 但可以存在另一项目组维护的相同项目, 通过标签属性或关键词相关联(领域)<br>
      // 供应商的供应服务可以看作为一个项目, 项目可分类为 组建中的(新项目), 活跃的(更新维护), 冷却的, 失效的(+失败的)<br>
      项目组是否跟随项目? 亦或与项目区分? 利于被动参与活动, 但若是组员不感兴趣..? 项目总组, 项目小组(临时组/可脱离组队亦可加入组队)<br>
      项目组(大组方向由总(会长)指定, 小组自由参与组成)(项目组必然不能完整转移到另一个项目, 故新项目必须要重组) 故分为 公会与组队<br>
      公会作用: 聚集同类同好者, 组织邀请小组, 参与项目, 但并不是调动全员的, 实际公会存在仅仅是维持生态环境, 组队存在是项目组目标 <br>
      EX : 组队同行对话, 同屏对话<br>
      公会: 计价模式与甄选非计价模式<br>
    </p>
  </div>
</template>

<script>
  export default {
    name: 'HelloWorld',
    data () {
      return {
        msg: 'Projct list',
        list: [
        { id: '646865', name: '组建发明创新团队', time: '88565466' }, // +项目状态
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        { id: '646865', name: '求道者的', time: '88565466' },
        ]
      }
    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
h1, h2 {
 font-weight: normal;
}
ul {
 list-style-type: none;
 padding: 0;
}
li {
 display: inline-block;
 margin: 0 10px;
}
a {
 color: #42b983;
}
</style>
